Repository: batmanwgd/serviceform
Catalog: serviceform/serviceform/locale/*/LC_MESSAGES/django.po
Languages: fi

source: ) from this system any more.
fi: ) tästä järjestelmästä tämän jälkeen.

source: You won't be getting any emails (as responsible for
fi: Et saa enää sähköposteja (vastuuhenkilönä lomakkeelle

source: Serviceform root. Nothing here
fi: Palveluhakemuslomakkeen juuurihakemisto. Ei mitään täällä.

source: Toggle navigation
fi: Näytä navigointi

source: You can delete your participation from the system by clicking
fi: Voit poistaa osallistumistietosi järjestelmästä painamalla

source: here
fi: tästä

source: Otherwise, please check if the information is correct and update it if necessary.
fi: Muussa tapauksessa, tarkista että tiedot ovat oikein ja päivitä niitä tarvittaessa.

source: Please fill in your contact details
fi: Syötä seuraavaksi yhteystietosi

source: Are you sure you want to delete your participation permanently from the system?
fi: Haluatko varmasti poistaa osallistumistietosi lopullisesti järjestelmästä?

source: Email sent to
fi: Sähköpostia lähetettiin osoitteeseen

source: Please verify your email address by clicking the link that is given in email. Then you can continue filling the form.
fi: Varmenna sähköpostiosoitteesi klikkaamalla sähköpostissa annettavaa linkkiä. Sen jälkeen voit jatkaa lomakkeen täyttämistä.

source: Form is not public at the moment.
fi: Lomake ei ole avoinna tällä hetkellä

source: Please fix errors below
fi: Korjaa alla olevat virheet

source: Responsible contact person(s)
fi: Vastuussa olevat yhteyshenkilö(t)

source: Please give additional information if needed
fi: Anna tähän tarvittaessa lisätietoa

source: Phone
fi: Puhelin

source: Contact details
fi: Yhteystiedot

source: Select all activities that you would like to participate by ticking boxes below.
fi: Valitse kaikki tehtävät joihin haluaisit osallistua ruksaamalla valintaruutuja

source: You can get more information about activity by pressing <span class='fa fa-info'></span> button.
fi: Saat lisää tietoa tehtävistä painamalla <span class='fa fa-info'></span>-nappia.

source: If you wish to give some extra information about your participation (such as when and how often you would like to participate), you can type extra details to the textbox that appears when you press <span class="fa fa-pencil"></span> button.
fi: Jos haluat antaa lisätietoa osallistumisestasi (kuten esim. milloin ja kuinka usein haluaisit osallistua), voit antaa lisätietoja tekstiruutuun joka tulee näkyviin kun painat <span class="fa fa-pencil"></span>-nappia.

source: Go to admin
fi: Lomakkeen hallintapaneeliin

source: Save and continue
fi: Tallenna ja jatka

source: Are you sure you want to leave form unsaved?
fi: Oletko varma että haluat jättää lomakkeen tallentamatta?

source: Please check that the given data is correct
fi: Tarkista että antamasi tiedot ovat oikein

source: Change contact details
fi: Muuta yhteystietoja

source: I am wishing to participate in the following activities
fi: Haluan osallistua seuraaviin toimintamuotoihin

source: Additional info
fi: Lisätietoja

source: Adjust participation information
fi: Muuta osallistumistietoja

source: Answers to questions
fi: Vastaukset kysymyksiin

source: Answer
fi: Vastaus

source: Modify question answers
fi: Muuta vastauksia

source: Are you ready to send data?
fi: Oletko valmis lähettämään tiedot?

source: Send data!
fi: Lähetä tiedot!

source: Please answer following questions.
fi: Vastaa seuraaviin kysymyksiin.

source: Thank you!
fi: Kiitos!

source: Your data was saved into the system and related responsibles will be informed about your participation.
fi: Antamasi tiedot tallennettiin järjestelmään ja tehtävien vastuuhenkilöille välitetään tieto halukkuudestasi osallistua tehtäviin.

source: You will receive also email that contains a link that you can use to edit your participation.
fi: Sinulle lähetettiin myös sähköposti joka sisältää linkin, jota voit käyttää, mikäli haluat myöhemmin muuttaa tietojasi tai ilmoittaa halukkuudestasi osallistua uusiin tehtäviin.

source: Fill a new form
fi: Täytä uusi lomake

source: Actions
fi: Toiminnot

source: Report for
fi: Raportit lomakkeelle

source: All activities
fi: Kaikki tehtävät

source: All participants
fi: Kaikki osallistujat

source: Responsible contact persons
fi: Vastuussa olevat yhteyshenkilöt

source: Participation to activities
fi: Tehtävien osallistumistiedot

source: Edit details
fi: Muokkaa tietoja

source: Send invitations
fi: Lähetä kutsuja

source: New auth link for
fi: Uusi autentikointilinkki käyttäjälle

source: Copy and paste this for him/her
fi: Kopioi ja liitä tämä hänelle

source: Responsible person contact details
fi: Vastuussa olevan yhteyshenkilön yhteystiedot

source: Can see full report
fi: Voi nähdä koko raportin

source: Configuration
fi: Valinnat

source: Expand all info
fi: Näytä kaikkien lisätiedot

source: Show participations from earlier revisions
fi: Näytä osallistujatiedot aiemmista versioista

source: Settings
fi: Asetukset

source: Each participant rows contains the following data
fi: Kunkin osallistujan rivi sisältää seuraavat tiedot

source: Email address
fi: Sähköpostiosoite

source: Age
fi: Ikä

source: Number of activities; colors from green (1 activity) to red (10 or more activities).
fi: Tehtävien lukumäärä; väri vihreästä (1 tehtävä) punaiseen (10 tehtävää tai enemmän)

source: Information buttons; pushing button will give more information
fi: Lisätietopainikkeet; saat lisätietoa painamalla painiketta

source: More information is given
fi: Osallistuja on jättänyt lisätietoja osallistumisesta

source: Notes have been entered
fi: Osallistujasta on jätetty muistiinpanoja

source: Number of activities
fi: Tehtävien lukumäärä

source: Log
fi: Muistiinpanot

source: Other information
fi: Muita tietoja

source: Add entry
fi: Lisää muistiinpano

source: Administrative functions (available for staff only)
fi: Toimintoja henkilökunnalle

source: Generate a new login link
fi: Luo uusi login-linkki

source: True
fi: Kyllä

source: False
fi: Ei

source: Email verification
fi: Sähköpostiosoitteen varmennus

source: Participation details
fi: Osallistumistiedot

source: Ready!
fi: Valmis!

source: Responsibles
fi: Vastuuhenkilöt

source: Participations
fi: Osallistumistiedot

source: Answers
fi: Vastaukset

source: My report
fi: Oma raportti

source: Report settings
fi: Raportin asetukset

source: Edit form
fi: Muokkaa lomaketta

source: Log out
fi: Kirjaudu ulos

source: Your report
fi: Raporttisi

source: Edit your contact details
fi: Muokkaa yhteystietojasi

source: To full report
fi: Koko raportti

source: Password login
fi: Kirjautuminen salasanalla

source: Former users
fi: Aikaisemmat käyttäjät

source: Admin login
fi: Ylläpidon kirjautuminen

source: User is not allowed to access document
fi: Käyttäjällä ei ole pääsyä dokumenttiin

source: Your authentication URL was expired. New link has been sent to {}
fi: Avainlinkkisi on vanhentunut. Uusi linkki on lähetetty osoitteeseen {}

source: Verification email already sent to {}, not sending again.
fi: Sähköpostin varmennusviesti on jo lähetetty osoitteeseen {}. Viestiä ei lähetetä uudelleen.

source: Authentication link was sent to email address {}.
fi: Lomakkeen tietojen muokkaamisen mahdollistava linkki lähetettiin sähköpostiosoitteeseen {}.

source: Your email {} is now verified successfully!
fi: Sähköpostiosoitteesi {} on nyt varmennettu!

source: Given URL might be expired. Please give your email address and we'll send you a new link
fi: Antamasi linkki voi olla vanhentunut tai muuten virheellinen. Anna sähköpostiosoitteesi niin lähetämme sinulle uuden linkin.

source: Your participation was deleted
fi: Osallistumistietosi poistettiin

source: Settings saved
fi: Asetukset tallennettu

source: Settings could not be saved
fi: Asetuksia ei voitu tallentaa

source: Saved contact details
fi: Yhteystiedot tallennettu

source: You have been logged out
fi: Olet kirjautunut ulos
