Repository: batmanwgd/serviceform
Catalog: serviceform/serviceform/locale/*/LC_MESSAGES/django.po
Languages: fi

source: {label} to {new_value} (was {old_value})
fi: {label} muutettiin arvoksi {new_value} (oli {old_value})

source: and
fi: ja

source: Changed %s.
fi: Muokattu %s.

source: Added %(name)s "%(object)s".
fi: Lisätty %(name)s "%(object)s".

source: Changed %(list)s for %(name)s "%(object)s".
fi: Muokattu %(list)s kohteelle %(name)s "%(object)s".

source: Deleted %(name)s "%(object)s".
fi: Poistettu %(name)s "%(object)s".

source: No fields changed.
fi: Ei muutoksia kenttiin.

source: Basic information
fi: Perustiedot

source: Ownership
fi: Omistajuus

source: Email settings
fi: Sähköpostiasetukset

source: Customization
fi: Lomakkeen asetukset

source: Ask details from participants
fi: Kysy nämä tiedot osallistujilta

source: Require details from participants
fi: Vaadi nämä tiedot osallistujilta

source: Bulk email former participants now!
fi: Lähetä massasähköpostia aikaisemmille osallistujille nyt!

source: Bulk email responsibility persons now!
fi: Lähetä massasähköpostia vastuuhenkilöille nyt!

source: Shuffle participant data
fi: Sekoita henkilötiedot

source: You have {} level 1 categories. We recommend that no more than 7 level 1 categories are used, if form flow is split to categories, so that form is rendered correctly.
fi: Sinulla on {} tason 1 kategoriaa. Jotta lomake näkyisi oikein, suosittelemme, että käytät maksimissaan 7 tason 1 kategoriaa, jos "Jaa osallistumislomake tason 1 kategorioiden mukaisesti osiin" -toiminto on käytössä.

source: Service form application
fi: Palvelulomake

source: Dear {{responsible}}, Participation results for {{form}} are now available for you to view. You can see all participants for the activities you are responsible of in the following URL: {{url}} From now on, you will also receive a notification message, if a new participation submitted to the areas you are responsible of.You can also adjust your contact details and email notification preferences from previously given URL. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{responsible}}, Osallistumistiedot lomakkeelle {{form}} ovat nyt tarkasteltavissa osoitteessa {{url}} Tästä lähtien saat ilmoituksen aina kun uusi osallistuja ilmoittautuu niihin vastuualueesi tehtäviin. Voit myös muokata yhteystietojasi sekä sähköposti-ilmoitusten asetuksia samasta osoitteesta Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{participant}}, You are invited to participate in "{{ form }}". You can fill in your participation details at {{ url }}. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{participant}}, Sinut on kutsuttu täyttämään lomake "{{form}}". Voit kertoa halukkuudestasi osallistua {{url}}. Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{responsible}}, New participation from {{participant}} has just been submitted to {{form}}. You can see all participants for the activities you are responsible of in the following URL: {{url}} You can also adjust your contact details and email notification preferences from that URL. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{responsible}}, Uusi osallistujatieto henkilöltä {{participant}} on tallennettu lomakkeeseen {{form}}. Voit tarkastella osallistujatietoja niihin tehtäviin joista olet vastuussa osoitteessa: {{url}} Voit myös muokata yhteystietojasi sekä sähköposti-ilmoitusten asetuksia samasta osoitteesta Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{participant}}, New form revision to "{{ form }}" has been published. Please update your participation information at {{ url }}. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{participant}}, Uusi versio lomakkeesta "{{form}}" on julkaistu. Päivitä osallistumistietosi osoitteessa {{url}}. Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{participant}}, You submitted form "{{ form }}" on {{ last_modified }}. If you wish to change any of the details you gave, you can go to {{ url }}. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{participant}}, Lähetit tiedot lomakkeeseen "{{form}}" ajankohtana {{last_modified}}. Jos haluat muuttaa antamiasi tietoja, voit mennä osoitteeseen {{url}}. Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{participant}}, You submitted update to your data on form "{{ form }}" on {{ last_modified }}. If you wish to change any of the details you gave, you can go to {{ url }}. Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{participant}}, Päivitit tietojasi lomakkeeseen "{{form}}" ajankohtana {{last_modified}}. Jos haluat muuttaa antamiasi tietoja, voit mennä osoitteeseen {{url}}. Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{responsible}}, You can see all participants for the activities you are responsible of in the following URL: {{url}} Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{responsible}}, Voit tarkastella osallistujatietoja niihin tehtäviin joista olet vastuussa osoitteessa: {{url}} Voit myös muokata yhteystietojasi sekä sähköposti-ilmoitusten asetuksia samasta osoitteesta Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Dear {{participant}}, Your email address needs to be verified. Please do so by clicking link below. Then you can continue filling the form. {{url}} Best regards, Service form system administrators Contact person: {{contact}}
fi: Hei {{participant}}, Sähköpostiosoitteesi pitää varmentaa. Voit tehdä sen klikkaamalla alla olevaa linkkiä. Sen jälkeen voit jatkaa lomakkeen täyttämistä. {{url}}. Parhain terveisin, Palvelulomakejärjestelmän ylläpito Yhteyshenkilö: {{contact}}

source: Revision
fi: Versio

source: Current
fi: Nykyinen

source: All
fi: Kaikki

source: Save settings
fi: Tallenna asetukset

source: Password
fi: Salasana

source: Get in
fi: Sisään!

source: Incorrect password
fi: Virheellinen salasana

source: Email
fi: Sähköposti

source: Send the link!
fi: Lähetä linkki!

source: There were no participation with email address {}
fi: Lomakkeelle ei löytynyt aikaisempaa osallistumistietoa sähköpostiosoitteella {}

source: Access link sent to email address {}
fi: Linkki lähetetty sähköpostiosoitteeseen {}

source: Email could not be sent to email address {}
fi: Sähköpostia ei voitu lähettää osoitteeseen {}

source: There were no responsible with email address {}
fi: Lomakkeelle ei löytynyt vastuuhenkilöä sähköpostiosoitteella {}

source: Continue
fi: Jatka

source: Save details
fi: Tallenna tiedot

source: Optional
fi: Vapaaehtoinen

source: Invalid year of birth
fi: Virheellinen syntymävuosi

source: You must be at least 10 years old
fi: Sinun pitää olla vähintään 10 vuotta vanha

source: If sending email is allowed email address need to be given
fi: Sähköpostiosoite pitää antaa, mikäli sähköpostin lähetys on asetettu sallituksi

source: resend auth link to your email!
fi: lähetä linkki sähköpostiisi!

source: There is already participation with this email address. To edit earlier participation, {}
fi: Lomakkeelle on jo annettu osallistujatieto tällä sähköpostiosoitteella. Muokataksesi aikaisempia osallistumistietoja, {}

source: Yes I am sure
fi: Olen varma

source: Delete
fi: Poista

source: Invalid activity input data
fi: Virhe

source: Invalid input data in radio button
fi: Virhe

source: Invalid choice input data
fi: Virhe

source: Invalid input data
fi: Virhe

source: No choices selected!
fi: Valitse yksi (tai useampi) vaihtoehdoista.

source: Invalid question input data
fi: Virhe

source: Answer required
fi: Vastaus on pakollinen

source: Send invitations also to participants that have participated in older form versions but not yet this form
fi: Lähetä kutsu myös niille henkilöille jotka ovat täyttäneet lomakkeen aikaisemman version, mutta eivät vielä uusinta

source: Email addresses, separated by comma, space or enter
fi: Sähköpostiosoitteet, erotettuna pilkulla, välilyönnillä tai rivinvaihdolla

source: Send invites
fi: Lähetä kutsut

source: Form is not yet published, emails can't be sent
fi: Lomake ei ole avoinna tällä hetkellä, sähköposteja ei voi lähettää

source: Invalid email: {}
fi: Virheellinen sähköpostiosoite: {}

source: Invitation sent to {}
fi: Kutsu lähetetty osoitteeseen {}

source: Invitation was not sent to {} because user already exists
fi: Kutsua ei lähetetty osoitteeseen {} koska käyttäjä on jo järjestelmässä

source: Invitation was not sent to {} because user denied emailing
fi: Kutsua ei lähetetty osoitteeseen {} koska käyttäjä on kieltänyt sähköpostien lähetyksen

source: Content
fi: Sisältö

source: Subject
fi: Otsikko

source: Email template
fi: Sähköpostimalli

source: Email templates
fi: Sähköpostimallit

source: Template name
fi: Mallin nimi

source: Following context may (depending on topic) be available for both subject and content: {{responsible}}, {{participant}}, {{last_modified}}, {{form}}, {{url}}, {{contact}}
fi: Seuraavat sisältömuuttujat ovat mahdollisesti (riippuen sähköpostin asiayhteydestä) käytettävissä sekä otsikkoon että sisältöön: {{responsible}}, {{participant}}, {{last_modified}}, {{form}}, {{url}}, {{contact}}

source: Phone number must be entered in the format: '050123123' or '+35850123123'. Up to 15 digits allowed.
fi: Puhelinnumeron pitää olla muotoa: '050123123' tai '+35850123123', enintään 15 merkkiä pitkä.

source: Enter a valid postal code.
fi: Syötä kunnollinen postinumero

source: Forename(s)
fi: Etunimi

source: Surname
fi: Sukunimi

source: Street address
fi: Katuosoite

source: Zip/Postal code
fi: Postinumero

source: City
fi: Kaupunki

source: Phone number
fi: Puhelinnumero

source: Contact details are needed so that the organization and its relevant responsibles can keep in touch with you related to your participation. Your <a href="http://data.consilium.europa.eu/doc/document/ST-5419-2016-INIT/fi/pdf#page=134">GDPR rights</a>.
fi: Yhteystietoja tarvitaan että organisaatio ja sen asiaankuuluvat vastuulliset voivat olla sinuun yhteydessä liittyen valitsemiisi palvelutehtäviin. <a href="http://data.consilium.europa.eu/doc/document/ST-5419-2016-INIT/fi/pdf#page=134">GDPR oikeutesi</a>.

source: Name
fi: Nimi

source: Address
fi: Osoite

source: Description
fi: Kuvaus

source: Secret key
fi: Salainen avain

source: Responsibility person
fi: Vastuuhenkilö

source: Responsibility persons
fi: Vastuuhenkilöt

source: Send email notifications
fi: Lähetä ilmoituksia sähköpostilla

source: Send email notifications whenever new participation to administered activities is registered. Email contains also has a link that allows accessing raport of administered activities.
fi: Lähetä sähköpostilla ilmoistus aina kun uusi henkilö on ilmoittautunut yhteen niistä tehtävistä, joista olet vastuussa. Sähköposti myös sisältää linkin, jonka avulla on mahdollista tarkastella henkiön hallinnoimiin tehtäviin osallistuneiden henkilöiden tietoja.

source: Hide contact details in form
fi: Piilota kaikki yhteystiedot lomakkeessa

source: Grant access to full reports
fi: Myönnä pääsy kaikkiin raportteihin

source: Link to personal report
fi: Linkki henkilökohtaiseen raporttiin

source: Participant
fi: Osallistuja

source: Participants
fi: Osallistujat

source: invited
fi: Kutsuttu

source: ongoing
fi: Meneillään

source: updating
fi: Päivittää tietoja

source: finished
fi: Valmis

source: Year of birth
fi: Syntymävuosi

source: Created at
fi: Luotu

source: Last modified
fi: Viimeksi muokattu

source: Last finished
fi: Viimeksi valmistunut

source: Email verified
fi: Sähköpostiosoite varmennettu

source: Sending email allowed
fi: Sähköpostin lähetys sallittu

source: You will receive email that contains a link that allows later modification of the form. Also when new version of form is published, you will be notified. It is highly recommended that you keep this enabled unless you move away and do not want to participate at all any more. You can also change this setting later if you wish.
fi: Saat sähköpostia joka sisältää linkin jonka avulla voit muuttaa tietoja myöhemmin. Tämän lisäksi uuden lomakkeen version julkaisemisen yhteydessä sinulle lähetetään sähköpostia. Suosittelemme, että sallit sähköpostituksen, paitsi siinä tapauksessa jos olet muuttanut pois etkä halua osallistua enää lainkaan. Voit myös myöhemmin muuttaa tätä asetusta.

source: Participant created in system
fi: Osallistuja talletettu ensimmäisen kerran järjestelmään

source: Email address verified
fi: Sähköpostiosoite varmennettu

source: No
fi: Ei

source: Yes
fi: Kyllä

source: Emails allowed
fi: Sähköpostin lähetys sallittu

source: Form status
fi: Lomakkeen tila

source: Activities
fi: Tehtävät

source: Form
fi: Lomake

source: Updated information has been stored! Please proceed until the end of the form.
fi: Päivitetyt tiedot on talletettu järjestelmään! Etenethän kuitenkin lomakkeen loppuun saakka.

source: Form revision
fi: Lomakkeen versio

source: Form revisions
fi: Lomakkeen versiot

source: Revision name
fi: Version nimi

source: Service form
fi: Palvelulomake

source: Valid from
fi: Voimassa alkaen

source: Valid to
fi: Voimassaolo päättyy

source: Send bulk email to participants
fi: Lähetä sähköpostia osallistujille

source: Send email to participants that filled the form when this revision was active. Email is sent when new current revision is published.
fi: Lähetä sähköpostia niille sallistujille jotka täyttivät lomakkeen silloin kun tämä versio oli aktiivinen. Sähköpostia lähetetään kun uusi versio lomakkeesta julkaistaan.

source: Email sending starts
fi: Sähköpostin lähetys alkaa

source: Sends bulk email to responsibility persons at specified time, after which it will send email for each new participation
fi: Lähetä ilmoitus vastuuhenkilöille määriteltynä aikana, jonka jälkeen sähköpostia lähetetään aina kun uusi ilmoittautuminen rekisteröityy järjestelmään.

source: Service forms
fi: Palvelulomakkeet

source: Name of the serviceform
fi: Palvelulomakkeen nimi

source: Slug
fi: Nimi URLissa

source: This is part of the form url, i.e. form will be located {}/yourslug
fi: Tämä on osa lomakkeen osoitetta, ts. lomakkeen osoitteeksi tulee {}/valitsemasi-nimi-urlissa

source: Last updated
fi: Viimeksi päivitetty

source: Last edited by
fi: Viimeisin muokkaaja

source: Responsible
fi: Vastuuhenkilö

source: Require email verification
fi: Vaadi sähköpostiosoitteen varmentamista

source: Verification email to participant
fi: Sähköpostin varmennusviesti osallistujalle

source: Email verification message that is sent to participant when filling form, if email verification is enabled
fi: Sähköpostin varmennusviesti joka lähetetään osallistujalle kun tämä täyttää lomaketta, mikäli sähköpostin varmennus vaaditaan.

source: Email to responsibles
fi: Sähköposti vastuullisille

source: Email that is sent to responsibles when new participation is registered
fi: Sähköposti, joka lähetetään vastuullisille kun uusi osallistujatieto on rekisteröity

source: Bulk email to responsibles
fi: Massasähköposti vastuullisille

source: Email that is sent to responsibles when emailing starts
fi: Sähköposti, joka lähetetään vastuullisille, kun vastuullisten sähköpostitus aloitetaan

source: Responsible requests auth link
fi: Vastuussa oleva yhteyshenkilö pyytää linkkiä raporttiin

source: Email that is sent to responsible when he requests auth link
fi: Sähköposti, joka lähetetään vastuullisille, kun vastuullinen pyytää raporttilinkkiä

source: Email to participant, on finish
fi: Sähköposti osallistujalle, valmis lomake

source: Email that is sent to participant after he has fulfilled his participation
fi: Sähköposti joka lähetetään osallistujalle sen jälkeen kun hän on jättänyt lomakkeen järjestelmään

source: Email to participant, on update
fi: Sähköposti osallistujalle, päivitetty lomake

source: Email that is sent to participant after he has updated his participation
fi: Sähköposti joka lähetetään osallistujalle sen jälkeen kun hän on päivittänyt tietojansa

source: Resend email to participant
fi: Sähköposti vastaanottajalle, uudelleenlähetys

source: Email that is sent to participant if he requests resending email
fi: Sähköposti, joka lähetetään osallistujalle jos hän pyytää sähköpostilinkin uudelleenlähetystä

source: Bulk email to former participants
fi: Massasähköpostia aikaisemmille osallistujille

source: Email that is sent to former participants when form is published
fi: Sähköposti joka lähetetään aikaisemmille osallistujille silloin kun lomake julkistetaan

source: Invite email
fi: Kutsusähköposti

source: Email that is sent when user is invited to the form manually via invite form
fi: Sähköposti joka lähetetään kun käyttäjä on kutsuttu järjestelmään

source: Current revision
fi: Käytössä oleva versio

source: You need to first add a revision to form (see below) and save. Then newly created revision will appear in the list.
fi: Lisää ensin lomakkeeseen versio (katso alla) ja tallenna. Sen jälkeen uusi versio ilmestyy listaan.

source: Password that is asked from participants
fi: Salasana kysellään lomakkeen täyttäjiltä

source: Hide contact details (other than email) in form
fi: Piilota yhteystiedot (muut paitsi sähköposti) lomakkeessa

source: Split participation form to level 1 categories
fi: Jaa osallistumislomake tason 1 kategorioiden mukaisesti osiin

source: Please note that preview shows full form despite this option
fi: Huomaa että esikatselu näyttää koko lomakkeen riippumatta tästä valinnasta

source: Allow jumping between categories
fi: Salli hyppiminen kategorioiden välillä

source: In effect only if flow by categories option is enabled. If this option is enabled, user can jump between categories. If disabled, he must proceed them one by one.
fi: Asetus on voimassa vain jos lomake on jaettu kategorioittain. Jos tämä asetus on päällä, käyttäjä voi hyppiä kategorioiden välillä. Jos asetus on poissa päältä, käyttäjän pitää käydä läpi kukin kategoria yksi kerrallaan.

source: Level 1 category default background color
fi: Tason 1 kategorian oletusarvoinen taustaväri

source: If left blank (black), default coloring will be used
fi: Jos tämä jätetään tyhjäksi (musta), käytetään oletusvärejä

source: Level 2 category default background color
fi: Tason 2 kategorian oletusarvoinen taustaväri

source: If left blank (black), it will be derived from level 1 background color
fi: Jos jätetään tyhjäksi (musta), väri johdetaan tason 1 kategorian taustaväristä

source: Activity default background color
fi: Aktiviteetin oletusarvoinen taustaväri

source: If left blank (black), it will be derived from level 2 background color
fi: Jos jätetään tyhjäksi (musta), väri johdetaan tason 2 kategorian taustaväristä

source: Description box will be shown before instruction box in participation view.
fi: Kuvaus näytetään osallistumisnäkymässä ennen lomakkeen täyttöohjeita

source: Instructions
fi: Ohjeet

source: Use HTML formatting. Leave this empty to use default. This is shown in participation view.
fi: Jos haluat käyttää oletusohjetta, voit jättää tämän tyhjäksi. Jos määrittelet ohjeen tässä, käytä HTML-muotoilua. Ohjeet näytetään osallistumisnäkymässä.

source: Login text
fi: Teksti kirjautumisnäkymässä

source: This will be shown in the login screen
fi: Tämä näytetään kirjautumisnäkymässä

source: Can access
fi: Pystyy muokkaamaan lomaketta

source: Default
fi: Oletus

source: defaultresponsible@email.com
fi: oletusvastuullinen@email.com

source: Default bulk email to responsibles
fi: Massasähköposti vastuullisille (oletus)

source: Participations can be now viewed for form {{form}}
fi: Osallistujatiedot lomakkeelle {{form}} ovat nyt tarkasteltavissa

source: Default email to responsibles
fi: Sähköposti vastuullisille (oletus)

source: New participation arrived for form {{form}}
fi: Uusi osallistujatieto lähetetty lomakkeelle {{form}}

source: Default email to participant, on finish
fi: Osallistujalle: valmis lomake (oletus)

source: Your update to form {{form}}
fi: Päivityksesi lomakkeelle {{form}}

source: Default email to participant, on update
fi: Osallistujalle: päivitetty lomake (oletus)

source: Your updated participation to form {{form}}
fi: Päivittämäsi osallistujatietosi lomakkeelle {{form}}

source: Default email to former participants
fi: Sähköposti aikaisemmille osallistujille (oletus)

source: New form revision to form {{form}} has been published
fi: Uusi versio lomakkeesta {{form}} on julkaistu

source: Default resend email to participant
fi: Sähköposti vastaanottajalle, uudelleenlähetys (oletus)

source: Your participation to form {{form}}
fi: Osallistujatietosi lomakkeelle {{form}}

source: Default invite email to participants
fi: Kutsusähköposti osallistujille (oletus)

source: Invitation to fill participation in {{form}}
fi: Kutsu täyttää osallistumistiedot lomakkeelle {{form}}

source: Default request responsible auth link email
fi: Sähköposti kun vastuuhenkilö pyytää raporttilinkkiä (oletus)

source: Your report in {{form}}
fi: Raporttisi lomakkeelle {{form}}

source: Default verification email to participant
fi: Sähköpostiosoitteen varmennusviesti osallistujalle (oletus)

source: Please verify your email in {{form}}
fi: Sinun pitää varmentaa sähköpostiosoiteesi lomakkeessa {{form}}

source: Is open?
fi: Auki?

source: To report
fi: Raporttiin

source: To form
fi: Lomakkeeseen

source: Preview
fi: Esikatselu

source: Printable
fi: Tulostettava

source: Invite
fi: Kutsu

source: Links
fi: Linkit

source: Participation count
fi: Osallistujien määrä

source: Order
fi: Järjestysnumero

source: Responsible persons
fi: Vastuuhenkilöt

source: Choose responsibles
fi: Valitse vastuuhenkilö(t)

source: {} (and others)
fi: {} (ja muita)

source: Background color
fi: Taustaväri

source: Level 1 category
fi: Tason 1 kategoria

source: Level 1 categories
fi: Tason 1 kategoriat

source: Level 2 category
fi: Tason 2 kategoria

source: Level 2 categories
fi: Tason 2 kategoriat

source: Activity
fi: Tehtävä

source: Category
fi: Luokittelu

source: Multichoice
fi: Monivalinta

source: Needed
fi: Tarve

source: Skip
fi: Ylim.

source: Activity choice
fi: Vaihtoehto

source: Activity choices
fi: Vaihtoehdot

source: Question
fi: Kysymys

source: Questions
fi: Kysymykset

source: Integer
fi: Kokonaisluku

source: Short text
fi: Lyhyt teksti

source: Long text
fi: Pitkä teksti

source: Boolean
fi: Kyllä / ei

source: Date
fi: Päivämäärä

source: Answer type
fi: Vastauksen tyyppi

source: Answer required?
fi: Vaaditaanko vastaus?

source: Sorry, page was not found.
fi: Anteeksi, sivua ei löytynyt

source: Admin
fi: Ylläpito

source: current
fi: nykyinen

source: If this is the first time you fill this form, you need a password to continue
fi: Jos tämä on ensimmäinen kerta kun täytät tämän lomakkeen, sinun pitää antaa salasana jatkaaksesi

source: If you have filled this form already in the past, please give your email below so we can send you a personal link to update your participation information.
fi: Jos olet täyttänyt tämän lomakkeen aikaisemmin, anna sähköpostiosoitteesi niin lähetämme sinulle henkilökohtaisen linkin, jonka kautta voit päivittää osallistumistietojasi.

source: If you are marked as a responsible person, please give your email below so we can send you a personal link to view your participation report.
fi: Jos sinut on merkitty vastuuhenkilöksi lomakkeelle, anna sähköpostiosoitteesi, niin lähetämme sinulle henkilökohtaisen linkin, jolla voit tarkastella raporttiasi.

source: You won't be getting any emails (as participant for
fi: Et saa enää sähköposteja (osallistujana lomakkeelle
